{
  "versions": [
    {
      "version": "0.7",
      "date": "10.28.2024",
      "changelog": "Fixed an issue that caused the packaged version of the game to freeze when closed."
    },
    {
      "version": "0.8",
      "date": "12.20.2024",
      "changelog": "Fixed сrash when closing PIE (Play In Editor) or using hot reload/recompilation."
    },
    {
      "version": "0.9",
      "date": "01.05.2025",
      "changelog": "Added a user notification system to inform about new updates. Resolved an issue where identical UE_LOG entries were displayed multiple times in the overlay panel. Fixed a crash when using the GLS_LOG_STRING macro. Addressed slow log creation when opening the overlay panel. The GLS overlay now appears instantly when pressing the ALT + SHIFT + G shortcut. Holding the keys for one second is no longer required. This behavior can be customized in the settings. Added sorting for categories in reverse alphabetical order (Z-A)."
    },
    {
      "version": "0.10",
      "date": "01.12.2025",
      "changelog": "The plugin is no longer considered an experimental version but remains in beta. Added the ability to save logs directly from the game build to a file (currently supported only on Windows). Settings now apply immediately upon changing any variable—no need to press Set As Default anymore. Introduced a breaking change for older versions: the GLS_LOG macro no longer requires the context parameter as its first argument. Updated the plugin documentation with detailed information and new sections."
    },
    {
      "version": "0.11",
      "date": "01.19.2025",
      "changelog": "Fixed an issue with automatic context capture when using the GLS_LOG macro. Added the ability to open the GLS overlay even when UI Only mode is enabled. Updated the technical solution for input handling, allowing the GLS overlay to be opened from anywhere in the game. Fixed a crash when reading editor save data between sessions. Added settings variables to control the hotkey hold duration required to open the GLS overlay on different device types."
    },
    {
      "version": "0.12",
      "date": "04.01.2025",
      "changelog": "Fixed the issue of duplicate log entries when using the PrintStringToGLS function and other minor bugs."
    },
    {
      "version": "0.13",
      "date": "04.06.2025",
      "changelog": "Added the ability to use GLS_LOGFMT. GLS_LOGFMT is a macro similar to UE_LOGFMT that allows you to format log messages using fmt::format syntax within the GLS logging system."
    },
    {
      "version": "0.14",
      "date": "04.21.2025",
      "changelog": "Tabs can now have custom user-defined names. Filter panels are now resizable via mouse drag. Filter categories now stay visible after clearing logs, with dimmed appearance if no logs are available. Filter categories appear fully opaque if there are logs to display, and semi-transparent if no logs are available. You can now hide logs by category using the eye icon, removing them from the main list. Added bStrictFilterMode setting to switch between OR (default) and AND logic for category filtering."
    },
    {
      "version": "0.14.1",
      "date": "04.21.2025",
      "changelog": "Fixed a bug with hiding logs for hidden categories when opening the overlay."
    },
    {
      "version": "0.14.2",
      "date": "04.22.2025",
      "changelog": "Fixed bugs related to creating and deleting tabs."
    },
    {
      "version": "0.14.3",
      "date": "04.23.2025",
      "changelog": "Fixed critical bugs related to performance and creating/deleting tabs."
    },
    {
      "version": "0.14.4",
      "date": "04.26.2025",
      "changelog": "Fixed an issue with adding filter categories to favorites and searching within filter categories."
    },
    {
      "version": "0.14.5",
      "date": "06.17.2025",
      "changelog": "Added support for UE 5.6. BP function PrintStringToGLS now accepts a context object for advanced filtering."
    },
    {
      "version": "0.14.6",
      "date": "06.18.2025",
      "changelog": "Fixed dedicated server compilation errors."
    }
  ]
}
